tangyangguang/Esp32Base/test/test_native_mqtt_harness/test_main.cpp
#include <unity.h>

#include <limits.h>
#include <stdio.h>
#include <string.h>

#include "../../src/Esp32BaseProfile.h"
#define private public
#include "../../src/network/Esp32BaseMqtt.h"
#undef private

#define ESP32BASE_LOG_I(...) ((void)0)
#define ESP32BASE_LOG_W(...) ((void)0)
#define ESP32BASE_LOG_D(...) ((void)0)
#define ESP32BASE_LOG_E(...) ((void)0)

bool g_fakeWifiConnected = false;
bool g_fakeRealTime = false;
uint32_t g_fakeMillis = 0;
uint32_t g_fakeRandom = 1;

class Esp32BaseWiFi {
public:
    static bool isConnected() { return g_fakeWifiConnected; }
};

class Esp32BaseTime {
public:
    enum Source : uint8_t {
        SOURCE_UPTIME = 0,
        SOURCE_RTC = 1,
        SOURCE_NTP = 2
    };
    struct Snapshot {
        bool synced;
        Source source;
        uint32_t epochSec;
    };
    static Source g_source;
    static bool isRealTime() { return g_fakeRealTime; }
    static Snapshot snapshot() {
        return {
            g_fakeRealTime,
            g_fakeRealTime ? g_source : SOURCE_UPTIME,
            g_fakeRealTime ? 1800000000u : 0u
        };
    }
};

Esp32BaseTime::Source Esp32BaseTime::g_source = Esp32BaseTime::SOURCE_NTP;

#include "mqtt_client.h"

struct esp_mqtt_client {
    int unused;
};

static esp_mqtt_client g_fakeClient;
static esp_event_handler_t g_fakeEventHandler = nullptr;
static esp_mqtt_client_config_t g_lastNativeConfig = {};
static int g_fakePacketId = 10;
static int g_fakeOutboxBytes = 0;
static int g_fakeSubscribeCount = 0;
static int g_fakeEnqueueResult = 0;
static int g_fakeStopCount = 0;
static int g_fakeDisconnectCount = 0;
static int g_fakeSetConfigCount = 0;
static esp_err_t g_fakeSetConfigResult = ESP_OK;
static char g_lastWillPayload[96] = {};

void captureNativeConfig(const esp_mqtt_client_config_t* config) {
    g_lastNativeConfig = *config;
    g_lastWillPayload[0] = '\0';
    if (config->lwt_msg && config->lwt_msg_len > 0) {
        const size_t length = static_cast<size_t>(config->lwt_msg_len) <
                                      sizeof(g_lastWillPayload) - 1
                                  ? static_cast<size_t>(config->lwt_msg_len)
                                  : sizeof(g_lastWillPayload) - 1;
        memcpy(g_lastWillPayload, config->lwt_msg, length);
        g_lastWillPayload[length] = '\0';
    }
}

esp_mqtt_client_handle_t esp_mqtt_client_init(const esp_mqtt_client_config_t* config) {
    captureNativeConfig(config);
    return &g_fakeClient;
}

esp_err_t esp_mqtt_client_start(esp_mqtt_client_handle_t) { return ESP_OK; }
esp_err_t esp_mqtt_client_stop(esp_mqtt_client_handle_t) {
    ++g_fakeStopCount;
    return ESP_OK;
}
esp_err_t esp_mqtt_client_disconnect(esp_mqtt_client_handle_t) {
    ++g_fakeDisconnectCount;
    return ESP_OK;
}
esp_err_t esp_mqtt_client_reconnect(esp_mqtt_client_handle_t) { return ESP_OK; }
esp_err_t esp_mqtt_client_destroy(esp_mqtt_client_handle_t) { return ESP_OK; }
esp_err_t esp_mqtt_set_config(
    esp_mqtt_client_handle_t,
    const esp_mqtt_client_config_t* config) {
    ++g_fakeSetConfigCount;
    if (g_fakeSetConfigResult == ESP_OK) {
        captureNativeConfig(config);
    }
    return g_fakeSetConfigResult;
}

esp_err_t esp_mqtt_client_register_event(
    esp_mqtt_client_handle_t,
    esp_mqtt_event_id_t,
    esp_event_handler_t handler,
    void*) {
    g_fakeEventHandler = handler;
    return ESP_OK;
}

int esp_mqtt_client_subscribe(esp_mqtt_client_handle_t, const char*, int) {
    ++g_fakeSubscribeCount;
    return ++g_fakePacketId;
}

int esp_mqtt_client_enqueue(
    esp_mqtt_client_handle_t,
    const char*,
    const char*,
    int length,
    int,
    int,
    bool) {
    if (g_fakeEnqueueResult < 0) {
        return g_fakeEnqueueResult;
    }
    g_fakeOutboxBytes += length + 32;
    return ++g_fakePacketId;
}

int esp_mqtt_client_get_outbox_size(esp_mqtt_client_handle_t) {
    return g_fakeOutboxBytes;
}

#include "../../src/network/Esp32BaseMqtt.inc"

namespace {

static const char TEST_CA[] =
    "-----BEGIN CERTIFICATE-----\nTEST\n-----END CERTIFICATE-----\n";

int g_applicationEventCount = 0;
Esp32BaseMqtt::Event g_lastApplicationEvent;
bool g_tryPublishOnUncertain = false;
Esp32BaseMqtt::PublishCode g_reentrantPublishCode =
    Esp32BaseMqtt::PUBLISH_ACCEPTED;
int g_messageCount = 0;
size_t g_lastPayloadLength = 0;
char g_lastTopic[ESP32BASE_MQTT_MAX_TOPIC_BYTES + 1] = {};
int g_beforeConnectCount = 0;
char g_dynamicWillPayload[96] = {};
Esp32BaseMqtt::LastWill* g_dynamicWill = nullptr;
bool g_makeDynamicWillInvalid = false;

void beforeConnect(void*) {
    ++g_beforeConnectCount;
    if (!g_dynamicWill) {
        return;
    }
    snprintf(g_dynamicWillPayload,
             sizeof(g_dynamicWillPayload),
             "offline-%d",
             g_beforeConnectCount);
    g_dynamicWill->payload =
        reinterpret_cast<const uint8_t*>(g_dynamicWillPayload);
    g_dynamicWill->payloadLength = g_makeDynamicWillInvalid
                                       ? ESP32BASE_MQTT_MAX_PAYLOAD_BYTES + 1
                                       : strlen(g_dynamicWillPayload);
}

void onEvent(const Esp32BaseMqtt::Event& event, void*) {
    ++g_applicationEventCount;
    g_lastApplicationEvent = event;
    if (g_tryPublishOnUncertain &&
        event.type == Esp32BaseMqtt::EVENT_PUBLISH_DELIVERY_UNCERTAIN) {
        static const uint8_t payload[] = "new";
        Esp32BaseMqtt::PublishRequest request;
        request.topic = "device/state";
        request.payload = payload;
        request.payloadLength = sizeof(payload) - 1;
        request.qos = Esp32BaseMqtt::QOS_1;
        g_reentrantPublishCode = Esp32BaseMqtt::publish(request).code;
    }
}

void onMessage(const Esp32BaseMqtt::MessageView& message, void*) {
    ++g_messageCount;
    g_lastPayloadLength = message.payloadLength;
    memcpy(g_lastTopic, message.topic, message.topicLength);
    g_lastTopic[message.topicLength] = '\0';
}

void resetModule() {
    if (g_mqttClient) {
        g_mqttClient = nullptr;
    }
    g_mqttConfig = {};
    memset(g_mqttSubscriptions, 0, sizeof(g_mqttSubscriptions));
    memset(g_mqttInflight, 0, sizeof(g_mqttInflight));
    memset(g_mqttIncoming, 0, sizeof(g_mqttIncoming));
    memset(g_mqttEvents, 0, sizeof(g_mqttEvents));
    g_mqttSubscriptionCount = 0;
    g_mqttEventRead = 0;
    g_mqttEventWrite = 0;
    g_mqttEventCount = 0;
    g_mqttAssemblySlot = -1;
    g_mqttDroppingPacketId = -1;
    g_mqttConfigured = false;
    g_mqttConfigurationAttempted = false;
    g_mqttBegun = false;
    g_mqttTerminalRejection = false;
    g_mqttConnectionConfigurationFailed = false;
    g_mqttEverConnected = false;
    g_mqttOtaSuspended = false;
    g_mqttReconnectRequested = false;
    g_mqttForceReconnectAfterDisconnect = false;
    g_mqttConnectionWanted = true;
    g_mqttClient = nullptr;
    g_mqttState = Esp32BaseMqtt::NOT_CONFIGURED;
    g_mqttLastError = Esp32BaseMqtt::ERROR_NONE;
    g_mqttPendingDisconnectError = Esp32BaseMqtt::ERROR_DISCONNECTED;
    g_mqttDiagnostics = {};
    g_mqttNextAttemptMs = 0;
    g_mqttBackoffStep = 0;
    g_mqttReportedMailboxDrops = 0;
    g_mqttReportedIncomingDrops = 0;
    g_mqttConnectedAtUptimeMs = 0;
    g_mqttConnectedAtEpochSec = 0;
    g_mqttMessageCallback = nullptr;
    g_mqttMessageContext = nullptr;
    g_mqttEventCallback = nullptr;
    g_mqttEventContext = nullptr;
    g_mqttBeforeConnectCallback = nullptr;
    g_mqttBeforeConnectContext = nullptr;
    g_fakeWifiConnected = false;
    g_fakeRealTime = false;
    Esp32BaseTime::g_source = Esp32BaseTime::SOURCE_NTP;
    g_fakeMillis = 0;
    g_fakeRandom = 1;
    g_fakeEventHandler = nullptr;
    g_lastNativeConfig = {};
    g_fakePacketId = 10;
    g_fakeOutboxBytes = 0;
    g_fakeSubscribeCount = 0;
    g_fakeEnqueueResult = 0;
    g_fakeStopCount = 0;
    g_fakeDisconnectCount = 0;
    g_fakeSetConfigCount = 0;
    g_fakeSetConfigResult = ESP_OK;
    g_lastWillPayload[0] = '\0';
    g_applicationEventCount = 0;
    g_tryPublishOnUncertain = false;
    g_reentrantPublishCode = Esp32BaseMqtt::PUBLISH_ACCEPTED;
    g_messageCount = 0;
    g_lastPayloadLength = 0;
    g_lastTopic[0] = '\0';
    g_beforeConnectCount = 0;
    g_dynamicWillPayload[0] = '\0';
    g_dynamicWill = nullptr;
    g_makeDynamicWillInvalid = false;
}

Esp32BaseMqtt::ConnectionConfig validConfig() {
    Esp32BaseMqtt::ConnectionConfig config;
    config.host = "broker.example";
    config.port = 8883;
    config.clientId = "native-test";
    config.security = Esp32BaseMqtt::TLS;
    config.tls.caCertificatePem = TEST_CA;
    config.tls.caCertificateLength = sizeof(TEST_CA);
    return config;
}

void emitEvent(esp_mqtt_event_id_t eventId,
               int packetId = 0,
               esp_mqtt_error_codes_t* error = nullptr) {
    esp_mqtt_event_t event = {};
    event.event_id = eventId;
    event.client = &g_fakeClient;
    event.msg_id = packetId;
    event.error_handle = error;
    g_fakeEventHandler(nullptr, nullptr, eventId, &event);
}

void startAndConnect() {
    TEST_ASSERT_TRUE(Esp32BaseMqtt::configure(validConfig()));
    TEST_ASSERT_TRUE(Esp32BaseMqtt::begin());
    g_fakeWifiConnected = true;
    g_fakeRealTime = true;
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::CONNECTING, Esp32BaseMqtt::state());
    emitEvent(MQTT_EVENT_BEFORE_CONNECT);
    emitEvent(MQTT_EVENT_CONNECTED);
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::CONNECTED, Esp32BaseMqtt::state());
}

