tangyangguang/Esp32Base/test/test_native_mqtt_harness/test_main.cpp
void test_configuration_requires_ca_and_rejects_plaintext_by_default() {
    Esp32BaseMqtt::ConnectionConfig config = validConfig();
    config.tls.caCertificatePem = nullptr;
    config.tls.caCertificateLength = 0;
    TEST_ASSERT_FALSE(Esp32BaseMqtt::configure(config));
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::CONFIGURATION_ERROR,
                      Esp32BaseMqtt::state());

    resetModule();
    config = validConfig();
    config.tls.caCertificateLength =
        ESP32BASE_MQTT_MAX_CA_CERT_BYTES + 1;
    TEST_ASSERT_FALSE(Esp32BaseMqtt::configure(config));

    resetModule();
    static const char disableVerification[] = "NULL";
    config = validConfig();
    config.tls.caCertificatePem = disableVerification;
    config.tls.caCertificateLength = sizeof(disableVerification);
    TEST_ASSERT_FALSE(Esp32BaseMqtt::configure(config));

    resetModule();
    config = validConfig();
    config.security = Esp32BaseMqtt::EXPLICIT_PLAINTEXT;
    config.tls = {};
    TEST_ASSERT_FALSE(Esp32BaseMqtt::configure(config));
}

void test_begin_never_starts_network_and_waits_for_prerequisites() {
    TEST_ASSERT_TRUE(Esp32BaseMqtt::configure(validConfig()));
    TEST_ASSERT_TRUE(Esp32BaseMqtt::begin());
    TEST_ASSERT_NULL(g_fakeEventHandler);

    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::WAITING_FOR_WIFI,
                      Esp32BaseMqtt::state());

    g_fakeWifiConnected = true;
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::WAITING_FOR_TIME,
                      Esp32BaseMqtt::state());

    g_fakeRealTime = true;
    Esp32BaseTime::g_source = Esp32BaseTime::SOURCE_RTC;
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::WAITING_FOR_TIME,
                      Esp32BaseMqtt::state());

    Esp32BaseTime::g_source = Esp32BaseTime::SOURCE_NTP;
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::CONNECTING,
                      Esp32BaseMqtt::state());
}

void test_callbacks_are_deferred_until_handle_and_subscriptions_repeat() {
    Esp32BaseMqtt::Subscription subscription;
    subscription.topicFilter = "device/+/command";
    subscription.qos = Esp32BaseMqtt::QOS_1;
    TEST_ASSERT_TRUE(Esp32BaseMqtt::addSubscription(subscription));
    Esp32BaseMqtt::setEventCallback(onEvent);
    startAndConnect();
    TEST_ASSERT_EQUAL(1, g_fakeSubscribeCount);
    TEST_ASSERT_EQUAL(1, g_applicationEventCount);

    char rejectedQos = static_cast<char>(0x80);
    esp_mqtt_event_t rejected = {};
    rejected.client = &g_fakeClient;
    rejected.msg_id = g_mqttSubscriptions[0].pendingPacketId;
    rejected.data = &rejectedQos;
    rejected.data_len = 1;
    g_fakeEventHandler(nullptr, nullptr, MQTT_EVENT_SUBSCRIBED, &rejected);
    TEST_ASSERT_EQUAL(1, g_applicationEventCount);
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(2, g_applicationEventCount);
    TEST_ASSERT_EQUAL(0,
                      Esp32BaseMqtt::diagnostics().subscriptionAcknowledged);

    emitEvent(MQTT_EVENT_DISCONNECTED);
    TEST_ASSERT_EQUAL(2, g_applicationEventCount);
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::BACKOFF, Esp32BaseMqtt::state());

    g_fakeMillis = g_mqttNextAttemptMs;
    Esp32BaseMqtt::handle(false);
    emitEvent(MQTT_EVENT_BEFORE_CONNECT);
    emitEvent(MQTT_EVENT_CONNECTED);
    TEST_ASSERT_EQUAL(3, g_applicationEventCount);
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(2, g_fakeSubscribeCount);
    TEST_ASSERT_TRUE(g_applicationEventCount >= 4);
}

void test_subscription_grant_survives_deferred_dispatch() {
    Esp32BaseMqtt::Subscription subscription;
    subscription.topicFilter = "device/command";
    subscription.qos = Esp32BaseMqtt::QOS_1;
    TEST_ASSERT_TRUE(Esp32BaseMqtt::addSubscription(subscription));
    Esp32BaseMqtt::setEventCallback(onEvent);
    startAndConnect();
    TEST_ASSERT_EQUAL_UINT8(0xFF, g_lastApplicationEvent.grantedQos);
    const struct { int length; uint8_t code; bool missing; } cases[] = {
        {1, 0, false}, {1, 1, false}, {1, 2, false},
        {1, 0x80, false}, {0, 1, false}, {1, 1, true},
        {2, 1, false}, {1, 3, false}, {-1, 1, false}
    };
    for (const auto& item : cases) {
        char codes[] = {static_cast<char>(item.code), 1};
        esp_mqtt_event_t event = {};
        event.client = &g_fakeClient;
        event.msg_id = 123;
        event.data = item.missing ? nullptr : codes;
        event.data_len = item.length;
        g_mqttSubscriptions[0].pendingPacketId = 123;
        const int before = g_applicationEventCount;
        g_fakeEventHandler(nullptr, nullptr, MQTT_EVENT_SUBSCRIBED, &event);
        TEST_ASSERT_EQUAL(before, g_applicationEventCount);
        codes[0] = 42; // Native callback data must not be borrowed after return.
        Esp32BaseMqtt::handle(false);
        TEST_ASSERT_EQUAL(before + 1, g_applicationEventCount);
        TEST_ASSERT_EQUAL_UINT8(0, g_lastApplicationEvent.subscriptionIndex);
        TEST_ASSERT_EQUAL_UINT16(123, g_lastApplicationEvent.packetId);
        TEST_ASSERT_EQUAL_UINT8(
            item.length == 1 && !item.missing && item.code <= 2
                ? item.code : 0xFF, g_lastApplicationEvent.grantedQos);
        TEST_ASSERT_EQUAL(item.code == 0x80
            ? Esp32BaseMqtt::EVENT_SUBSCRIPTION_REJECTED
            : Esp32BaseMqtt::EVENT_SUBSCRIPTION_ACKNOWLEDGED,
            g_lastApplicationEvent.type);
    }
}

void test_qos1_publish_ack_and_outbox_limit() {
    Esp32BaseMqtt::setEventCallback(onEvent);
    startAndConnect();
    const uint8_t payload[] = {1, 2, 3};
    Esp32BaseMqtt::PublishRequest request;
    request.topic = "device/state";
    request.payload = payload;
    request.payloadLength = sizeof(payload);
    request.qos = Esp32BaseMqtt::QOS_1;
    const Esp32BaseMqtt::PublishResult result = Esp32BaseMqtt::publish(request);
    TEST_ASSERT_TRUE(result.accepted());
    TEST_ASSERT_EQUAL(1, Esp32BaseMqtt::diagnostics().inflightQos1);

    emitEvent(MQTT_EVENT_PUBLISHED, result.packetId);
    TEST_ASSERT_EQUAL(1, Esp32BaseMqtt::diagnostics().inflightQos1);
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(0, Esp32BaseMqtt::diagnostics().inflightQos1);
    TEST_ASSERT_EQUAL(1, Esp32BaseMqtt::diagnostics().publishAcknowledged);

