tangyangguang/Esp32Base/test/test_native_mqtt_harness/test_main.cpp
    g_fakeOutboxBytes = ESP32BASE_MQTT_MAX_OUTBOX_BYTES;
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::PUBLISH_OUTBOX_FULL,
                      Esp32BaseMqtt::publish(request).code);
    g_fakeOutboxBytes = 0;

    const Esp32BaseMqtt::PublishResult uncertain =
        Esp32BaseMqtt::publish(request);
    TEST_ASSERT_TRUE(uncertain.accepted());
    g_tryPublishOnUncertain = true;
    emitEvent(MQTT_EVENT_DISCONNECTED);
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(0, Esp32BaseMqtt::diagnostics().inflightQos1);
    TEST_ASSERT_EQUAL(
        1, Esp32BaseMqtt::diagnostics().publishDeliveryUncertain);
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::PUBLISH_NOT_CONNECTED,
                      g_reentrantPublishCode);
}

void test_disconnect_discards_queued_and_partial_incoming_messages() {
    Esp32BaseMqtt::setMessageCallback(onMessage);
    startAndConnect();
    char topic[] = "device/command";
    char data[] = "abc";
    esp_mqtt_event_t incoming = {};
    incoming.client = &g_fakeClient;
    incoming.event_id = MQTT_EVENT_DATA;
    incoming.topic = topic;
    incoming.topic_len = strlen(topic);
    incoming.data = data;
    incoming.data_len = 3;
    incoming.total_data_len = 3;
    incoming.msg_id = 1;
    handleIncomingData(&incoming);
    incoming.msg_id = 2;
    incoming.total_data_len = 6;
    handleIncomingData(&incoming);
    TEST_ASSERT_EQUAL(2, incomingUsedLocked());
    emitEvent(MQTT_EVENT_DISCONNECTED);
    TEST_ASSERT_EQUAL(0, incomingUsedLocked());
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(0, g_messageCount);
    TEST_ASSERT_EQUAL_UINT32(2, Esp32BaseMqtt::diagnostics().incomingMailboxDropped);
}

void test_ota_preparation_does_not_dispatch_application_callbacks() {
    startAndConnect();
    const int before = g_applicationEventCount;
    emitEvent(MQTT_EVENT_PUBLISHED, 42);
    esp32base_internal::suspendMqttForOta();
    TEST_ASSERT_EQUAL(before, g_applicationEventCount);
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::SUSPENDED_FOR_OTA, Esp32BaseMqtt::state());
    emitEvent(MQTT_EVENT_DISCONNECTED);
    Esp32BaseMqtt::handle(true);
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::SUSPENDED_FOR_OTA, Esp32BaseMqtt::state());
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_NOT_EQUAL(Esp32BaseMqtt::SUSPENDED_FOR_OTA, Esp32BaseMqtt::state());
}

void test_publish_capacity_does_not_expand_incoming_slots() {
    TEST_ASSERT_EQUAL_UINT32(ESP32BASE_MQTT_MAX_INCOMING_PAYLOAD_BYTES,
                             sizeof(g_mqttIncoming[0].payload));
    startAndConnect();
    static uint8_t payload[ESP32BASE_MQTT_MAX_PAYLOAD_BYTES] = {};
    Esp32BaseMqtt::PublishRequest request;
    request.topic = "device/state";
    request.payload = payload;
    request.payloadLength = sizeof(payload);
    request.qos = Esp32BaseMqtt::QOS_1;
    TEST_ASSERT_TRUE(Esp32BaseMqtt::publish(request).accepted());
}

void test_fragment_assembly_and_oversize_drop() {
    Esp32BaseMqtt::setMessageCallback(onMessage);
    startAndConnect();
    char topic[] = "device/command";
    char first[] = "abc";
    char second[] = "def";
    esp_mqtt_event_t event = {};
    event.client = &g_fakeClient;
    event.event_id = MQTT_EVENT_DATA;
    event.msg_id = 55;
    event.topic = topic;
    event.topic_len = strlen(topic);
    event.data = first;
    event.data_len = 3;
    event.total_data_len = 6;
    event.current_data_offset = 0;
    g_fakeEventHandler(nullptr, nullptr, MQTT_EVENT_DATA, &event);
    TEST_ASSERT_EQUAL(0, g_messageCount);

    event.topic = nullptr;
    event.topic_len = 0;
    event.data = second;
    event.current_data_offset = 3;
    g_fakeEventHandler(nullptr, nullptr, MQTT_EVENT_DATA, &event);
    TEST_ASSERT_EQUAL(0, g_messageCount);
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(1, g_messageCount);
    TEST_ASSERT_EQUAL(6, g_lastPayloadLength);
    TEST_ASSERT_EQUAL_STRING("device/command", g_lastTopic);

    event.msg_id = 56;
    event.topic = topic;
    event.topic_len = strlen(topic);
    event.total_data_len = ESP32BASE_MQTT_MAX_INCOMING_PAYLOAD_BYTES + 1;
    event.current_data_offset = 0;
    g_fakeEventHandler(nullptr, nullptr, MQTT_EVENT_DATA, &event);
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(1, g_messageCount);
    TEST_ASSERT_EQUAL(1, Esp32BaseMqtt::diagnostics().incomingOversizeDropped);

    event.msg_id = 57;
    event.total_data_len = INT_MAX;
    event.current_data_offset = INT_MAX;
    event.data_len = INT_MAX;
    g_fakeEventHandler(nullptr, nullptr, MQTT_EVENT_DATA, &event);
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(1, g_messageCount);
    TEST_ASSERT_EQUAL(2, Esp32BaseMqtt::diagnostics().incomingOversizeDropped);
}

void test_terminal_auth_rejection_requires_explicit_retry() {
    startAndConnect();
    esp_mqtt_error_codes_t error = {};
    error.error_type = MQTT_ERROR_TYPE_CONNECTION_REFUSED;
    error.connect_return_code = MQTT_CONNECTION_REFUSE_NOT_AUTHORIZED;
    emitEvent(MQTT_EVENT_ERROR, 0, &error);
    emitEvent(MQTT_EVENT_DISCONNECTED);
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::CONNECTION_REJECTED,
                      Esp32BaseMqtt::state());
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::ERROR_NOT_AUTHORIZED,
                      Esp32BaseMqtt::status().lastError);
    TEST_ASSERT_TRUE(Esp32BaseMqtt::requestReconnect());
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::BACKOFF, Esp32BaseMqtt::state());
}

void test_lwt_is_mapped_and_ota_suspends_without_direct_callback() {
    static const uint8_t willPayload[] = "offline";
    Esp32BaseMqtt::LastWill will;
    will.topic = "device/availability";
    will.payload = willPayload;
    will.payloadLength = sizeof(willPayload) - 1;
    will.qos = Esp32BaseMqtt::QOS_1;
    will.retain = true;
    Esp32BaseMqtt::ConnectionConfig config = validConfig();
    config.lastWill = &will;
    TEST_ASSERT_TRUE(Esp32BaseMqtt::configure(config));
    Esp32BaseMqtt::setEventCallback(onEvent);
    TEST_ASSERT_TRUE(Esp32BaseMqtt::begin());
    g_fakeWifiConnected = true;
    g_fakeRealTime = true;
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL_STRING("device/availability", g_lastNativeConfig.lwt_topic);
    TEST_ASSERT_EQUAL(7, g_lastNativeConfig.lwt_msg_len);
    TEST_ASSERT_EQUAL(1, g_lastNativeConfig.lwt_qos);
    TEST_ASSERT_EQUAL(1, g_lastNativeConfig.lwt_retain);

