tangyangguang/Esp32Base/test/test_native_mqtt_harness/test_main.cpp
    emitEvent(MQTT_EVENT_CONNECTED);
    TEST_ASSERT_EQUAL(0, g_applicationEventCount);
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(1, g_applicationEventCount);
    Esp32BaseMqtt::handle(true);
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::SUSPENDED_FOR_OTA,
                      Esp32BaseMqtt::state());
    TEST_ASSERT_EQUAL(1, g_applicationEventCount);
    TEST_ASSERT_EQUAL(1, g_fakeDisconnectCount);
    TEST_ASSERT_EQUAL(0, g_fakeStopCount);
    emitEvent(MQTT_EVENT_DISCONNECTED);
    Esp32BaseMqtt::handle(true);
    TEST_ASSERT_EQUAL(2, g_applicationEventCount);
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::SUSPENDED_FOR_OTA,
                      Esp32BaseMqtt::state());
}

void test_before_connect_refreshes_lwt_for_every_attempt() {
    Esp32BaseMqtt::LastWill will;
    will.topic = "device/availability";
    will.payload = reinterpret_cast<const uint8_t*>(g_dynamicWillPayload);
    will.payloadLength = 0;
    will.qos = Esp32BaseMqtt::QOS_1;
    will.retain = true;
    g_dynamicWill = &will;

    Esp32BaseMqtt::ConnectionConfig config = validConfig();
    config.lastWill = &will;
    TEST_ASSERT_TRUE(Esp32BaseMqtt::configure(config));
    TEST_ASSERT_TRUE(
        Esp32BaseMqtt::setBeforeConnectCallback(beforeConnect));
    TEST_ASSERT_TRUE(Esp32BaseMqtt::begin());
    g_fakeWifiConnected = true;
    g_fakeRealTime = true;

    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(1, g_beforeConnectCount);
    TEST_ASSERT_EQUAL_STRING("offline-1", g_lastWillPayload);
    emitEvent(MQTT_EVENT_BEFORE_CONNECT);
    TEST_ASSERT_EQUAL(1, g_fakeSetConfigCount);
    TEST_ASSERT_EQUAL_STRING("offline-1", g_lastWillPayload);
    emitEvent(MQTT_EVENT_CONNECTED);
    Esp32BaseMqtt::handle(false);

    emitEvent(MQTT_EVENT_DISCONNECTED);
    Esp32BaseMqtt::handle(false);
    g_fakeMillis = g_mqttNextAttemptMs;
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(2, g_beforeConnectCount);
    emitEvent(MQTT_EVENT_BEFORE_CONNECT);
    TEST_ASSERT_EQUAL(2, g_fakeSetConfigCount);
    TEST_ASSERT_EQUAL_STRING("offline-2", g_lastWillPayload);
}

void test_before_connect_output_is_revalidated() {
    Esp32BaseMqtt::LastWill will;
    will.topic = "device/availability";
    will.payload = reinterpret_cast<const uint8_t*>(g_dynamicWillPayload);
    will.payloadLength = 0;
    will.qos = Esp32BaseMqtt::QOS_1;
    will.retain = true;
    g_dynamicWill = &will;
    g_makeDynamicWillInvalid = true;

    Esp32BaseMqtt::ConnectionConfig config = validConfig();
    config.lastWill = &will;
    TEST_ASSERT_TRUE(Esp32BaseMqtt::configure(config));
    TEST_ASSERT_TRUE(
        Esp32BaseMqtt::setBeforeConnectCallback(beforeConnect));
    TEST_ASSERT_TRUE(Esp32BaseMqtt::begin());
    g_fakeWifiConnected = true;
    g_fakeRealTime = true;

    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::CONFIGURATION_ERROR,
                      Esp32BaseMqtt::state());
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::ERROR_INVALID_CONFIGURATION,
                      Esp32BaseMqtt::status().lastError);
    TEST_ASSERT_EQUAL_UINT32(
        1,
        Esp32BaseMqtt::diagnostics().connectionConfigurationFailures);
    TEST_ASSERT_EQUAL_UINT32(0,
                             Esp32BaseMqtt::diagnostics().connectAttempts);
    TEST_ASSERT_NULL(g_fakeEventHandler);
}

void test_native_before_connect_update_failure_is_terminal_until_retry() {
    startAndConnect();
    emitEvent(MQTT_EVENT_DISCONNECTED);
    Esp32BaseMqtt::handle(false);
    g_fakeMillis = g_mqttNextAttemptMs;
    Esp32BaseMqtt::handle(false);
    for (uint8_t i = 0; i < ESP32BASE_MQTT_EVENT_SLOTS; ++i) {
        RawEvent queued;
        queued.type = RAW_PUBLISHED;
        queued.packetId = static_cast<int32_t>(100 + i);
        TEST_ASSERT_TRUE(pushRawEvent(queued));
    }
    const int subscriptionsBeforeFailure = g_fakeSubscribeCount;
    g_fakeSetConfigResult = ESP_ERR_NO_MEM;
    emitEvent(MQTT_EVENT_BEFORE_CONNECT);
    TEST_ASSERT_FALSE(isConnectionWanted());
    emitEvent(MQTT_EVENT_CONNECTED);
    TEST_ASSERT_EQUAL(subscriptionsBeforeFailure, g_fakeSubscribeCount);
    Esp32BaseMqtt::handle(false);

    TEST_ASSERT_EQUAL(Esp32BaseMqtt::CONFIGURATION_ERROR,
                      Esp32BaseMqtt::state());
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::ERROR_NO_MEMORY,
                      Esp32BaseMqtt::status().lastError);
    TEST_ASSERT_EQUAL_UINT32(
        1,
        Esp32BaseMqtt::diagnostics().connectionConfigurationFailures);
    TEST_ASSERT_EQUAL_UINT32(
        1,
        Esp32BaseMqtt::diagnostics().controlEventDropped);
    TEST_ASSERT_TRUE(Esp32BaseMqtt::requestReconnect());
    g_fakeSetConfigResult = ESP_OK;
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::BACKOFF, Esp32BaseMqtt::state());
}

void test_incoming_mailbox_full_drops_whole_message() {
    Esp32BaseMqtt::setMessageCallback(onMessage);
    Esp32BaseMqtt::setEventCallback(onEvent);
    startAndConnect();
    g_applicationEventCount = 0;
    char topic[] = "device/command";
    char payload[] = "x";
    for (int packetId = 1; packetId <= 3; ++packetId) {
        esp_mqtt_event_t event = {};
        event.client = &g_fakeClient;
        event.event_id = MQTT_EVENT_DATA;
        event.msg_id = packetId;
        event.topic = topic;
        event.topic_len = strlen(topic);
        event.data = payload;
        event.data_len = 1;
        event.total_data_len = 1;
        event.current_data_offset = 0;
        g_fakeEventHandler(nullptr, nullptr, MQTT_EVENT_DATA, &event);
    }
    TEST_ASSERT_EQUAL(0, g_messageCount);
    TEST_ASSERT_EQUAL(1, Esp32BaseMqtt::diagnostics().incomingMailboxDropped);
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(2, g_messageCount);
    TEST_ASSERT_EQUAL(1, g_applicationEventCount);
}

void test_connection_event_survives_full_control_mailbox() {
    startAndConnect();
    for (int i = 0; i < ESP32BASE_MQTT_EVENT_SLOTS; ++i) {
        emitEvent(MQTT_EVENT_PUBLISHED, 100 + i);
    }
    emitEvent(MQTT_EVENT_DISCONNECTED);
    TEST_ASSERT_EQUAL(1, Esp32BaseMqtt::diagnostics().controlEventDropped);
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::BACKOFF, Esp32BaseMqtt::state());
}

void test_dns_and_certificate_errors_are_distinguished() {
    startAndConnect();
    esp_mqtt_error_codes_t dnsError = {};
    dnsError.error_type = MQTT_ERROR_TYPE_TCP_TRANSPORT;
    dnsError.esp_tls_last_esp_err =
        ESP_ERR_ESP_TLS_CANNOT_RESOLVE_HOSTNAME;
    emitEvent(MQTT_EVENT_ERROR, 0, &dnsError);
    emitEvent(MQTT_EVENT_DISCONNECTED);
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::ERROR_DNS_OR_TRANSPORT,
                      Esp32BaseMqtt::status().lastError);

    RawEvent certificateError;
    certificateError.type = RAW_ERROR;
    certificateError.certificateFlags = 1;
    bool terminal = false;
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::ERROR_TLS_CERTIFICATE,
                      classifyError(certificateError, terminal));
    TEST_ASSERT_TRUE(terminal);
}

void test_reports_platform_certificate_date_check_capability() {
    TEST_ASSERT_TRUE(Esp32BaseMqtt::configure(validConfig()));
    const Esp32BaseMqtt::Status status = Esp32BaseMqtt::status();
    TEST_ASSERT_TRUE(status.tls);
    TEST_ASSERT_FALSE(status.certificateDateCheckEnabled);
    TEST_ASSERT_EQUAL_STRING(
        "tls_certificate_date_check_unavailable",
        Esp32BaseMqtt::errorName(
            Esp32BaseMqtt::ERROR_TLS_CERTIFICATE_DATE_CHECK_UNAVAILABLE));
}

void test_certificate_error_without_flags_stops_automatic_retries() {
    startAndConnect();
    const int codes[] = {MBEDTLS_ERR_X509_CERT_VERIFY_FAILED,
                         -MBEDTLS_ERR_X509_CERT_VERIFY_FAILED};
    for (int code : codes) {
        RawEvent raw;
        raw.type = RAW_ERROR;
        raw.tlsError = code;
        bool terminal = false;
        TEST_ASSERT_EQUAL(Esp32BaseMqtt::ERROR_TLS_CERTIFICATE,
                          classifyError(raw, terminal));
        TEST_ASSERT_TRUE(terminal);
    }
    esp_mqtt_error_codes_t error = {};
    error.error_type = MQTT_ERROR_TYPE_TCP_TRANSPORT;
    error.esp_tls_stack_err = -MBEDTLS_ERR_X509_CERT_VERIFY_FAILED;
    emitEvent(MQTT_EVENT_ERROR, 0, &error);
    emitEvent(MQTT_EVENT_DISCONNECTED);
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::ERROR_TLS_CERTIFICATE,
                      Esp32BaseMqtt::status().lastError);
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::CONNECTION_REJECTED, Esp32BaseMqtt::state());
    TEST_ASSERT_EQUAL(0, Esp32BaseMqtt::diagnostics().nativeCertificateFlags);
    const uint32_t attempts = Esp32BaseMqtt::diagnostics().connectAttempts;
    g_fakeMillis += 120000;
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(attempts, Esp32BaseMqtt::diagnostics().connectAttempts);
    TEST_ASSERT_TRUE(Esp32BaseMqtt::requestReconnect());
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::BACKOFF, Esp32BaseMqtt::state());
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_GREATER_THAN(attempts, Esp32BaseMqtt::diagnostics().connectAttempts);
}

void test_secure_default_rejects_missing_certificate_date_check() {
    TEST_ASSERT_FALSE(Esp32BaseMqtt::configure(validConfig()));
    const Esp32BaseMqtt::Status status = Esp32BaseMqtt::status();
    TEST_ASSERT_FALSE(status.configured);
    TEST_ASSERT_FALSE(status.certificateDateCheckEnabled);
    TEST_ASSERT_EQUAL(
        Esp32BaseMqtt::ERROR_TLS_CERTIFICATE_DATE_CHECK_UNAVAILABLE,
        status.lastError);
}

void test_terminal_rejection_survives_wifi_loss_and_recovery() {
    TEST_ASSERT_TRUE(Esp32BaseMqtt::configure(validConfig()));
    TEST_ASSERT_TRUE(Esp32BaseMqtt::begin());
    g_fakeWifiConnected = true;
    g_fakeRealTime = true;
    Esp32BaseMqtt::handle(false);

    esp_mqtt_error_codes_t authError = {};
    authError.error_type = MQTT_ERROR_TYPE_CONNECTION_REFUSED;
    authError.connect_return_code = MQTT_CONNECTION_REFUSE_BAD_USERNAME;
    emitEvent(MQTT_EVENT_ERROR, 0, &authError);
    emitEvent(MQTT_EVENT_DISCONNECTED);
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::CONNECTION_REJECTED,
                      Esp32BaseMqtt::state());

    g_fakeWifiConnected = false;
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::CONNECTION_REJECTED,
                      Esp32BaseMqtt::state());
    g_fakeWifiConnected = true;
    Esp32BaseMqtt::handle(false);
    TEST_ASSERT_EQUAL(Esp32BaseMqtt::CONNECTION_REJECTED,
                      Esp32BaseMqtt::state());
    TEST_ASSERT_EQUAL_UINT32(1, Esp32BaseMqtt::diagnostics().connectAttempts);
}

void test_backoff_deadline_is_millis_wrap_safe() {
    TEST_ASSERT_TRUE(deadlineReached(3u, UINT32_MAX - 2u));
    TEST_ASSERT_FALSE(deadlineReached(UINT32_MAX - 3u, 2u));
}

