tangyangguang/Esp32Base/test/test_native_mqtt_harness/test_main.cpp
} // namespace

void setUp() {
    resetModule();
}

void tearDown() {}

int main(int, char**) {
    UNITY_BEGIN();
#if ESP32BASE_MQTT_EXPECT_DATE_CHECK_REJECTION
    RUN_TEST(test_secure_default_rejects_missing_certificate_date_check);
#else
    RUN_TEST(test_configuration_requires_ca_and_rejects_plaintext_by_default);
    RUN_TEST(test_begin_never_starts_network_and_waits_for_prerequisites);
    RUN_TEST(test_callbacks_are_deferred_until_handle_and_subscriptions_repeat);
    RUN_TEST(test_subscription_grant_survives_deferred_dispatch);
    RUN_TEST(test_qos1_publish_ack_and_outbox_limit);
    RUN_TEST(test_disconnect_discards_queued_and_partial_incoming_messages);
    RUN_TEST(test_ota_preparation_does_not_dispatch_application_callbacks);
    RUN_TEST(test_publish_capacity_does_not_expand_incoming_slots);
    RUN_TEST(test_fragment_assembly_and_oversize_drop);
    RUN_TEST(test_terminal_auth_rejection_requires_explicit_retry);
    RUN_TEST(test_lwt_is_mapped_and_ota_suspends_without_direct_callback);
    RUN_TEST(test_before_connect_refreshes_lwt_for_every_attempt);
    RUN_TEST(test_before_connect_output_is_revalidated);
    RUN_TEST(test_native_before_connect_update_failure_is_terminal_until_retry);
    RUN_TEST(test_incoming_mailbox_full_drops_whole_message);
    RUN_TEST(test_connection_event_survives_full_control_mailbox);
    RUN_TEST(test_dns_and_certificate_errors_are_distinguished);
    RUN_TEST(test_certificate_error_without_flags_stops_automatic_retries);
    RUN_TEST(test_reports_platform_certificate_date_check_capability);
    RUN_TEST(test_terminal_rejection_survives_wifi_loss_and_recovery);
    RUN_TEST(test_backoff_deadline_is_millis_wrap_safe);
#endif
    return UNITY_END();
}
